to-do.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-23 sáb 03:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Listado de tareas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pablo Dávila Herrero" />
</head>
<body>
<div id="content">
<h1 class="title">Listado de tareas</h1>

<div id="outline-container-orgbdc71e0" class="outline-2">
<h2 id="orgbdc71e0"><span class="section-number-2">1</span> <code>[7/10]</code> Diseño HTML+CSS</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Hasta el entregable 2.</li>
<li class="on"><code>[X]</code> Introducir URL sin pop-up.</li>
<li class="on"><code>[X]</code> Limitar el tamaño de la imagen en Detalles y Editar.</li>
<li class="on"><code>[X]</code> Seleccionar visibilidad de imagen.</li>
<li class="on"><code>[X]</code> Hacer más intuitivo el cartel siguiendo-seguidos.</li>
<li class="on"><code>[X]</code> Destacar la página actual en la barra superior.</li>
<li class="off"><code>[&#xa0;]</code> Cambiar sistema de etiquetas.</li>
<li class="on"><code>[X]</code> Cambiar posición '+'.</li>
<li class="off"><code>[&#xa0;]</code> Imagen de fondo. (?)</li>
<li class="off"><code>[&#xa0;]</code> Enlace a GitHub.</li>
</ul>
</div>
</div>

<div id="outline-container-org831f529" class="outline-2">
<h2 id="org831f529"><span class="section-number-2">2</span> <code>[15/17]</code> Implementación JavaScript</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> Registro: Validación de formulario.</li>
<li><code>[6/8]</code> Cargar desde backend
<ul class="org-ul">
<li class="on"><code>[X]</code> Detalle de foto.</li>
<li class="on"><code>[X]</code> Editar foto.</li>
<li class="on"><code>[X]</code> Nuevo.</li>
<li class="on"><code>[X]</code> Imágenes trending.</li>
<li class="off"><code>[&#xa0;]</code> Usuarios trending.</li>
<li class="off"><code>[&#xa0;]</code> Siguiendo.</li>
<li class="on"><code>[X]</code> Etiquetas.</li>
<li><code>[3/3]</code> Mi perfil
<ul class="org-ul">
<li class="on"><code>[X]</code> Datos de usuario.</li>
<li class="on"><code>[X]</code> Seguidores/seguidos.</li>
<li class="on"><code>[X]</code> Imágenes del usuario.</li>
</ul></li>
<li class="on"><code>[X]</code> Usuarios siguiendo/seguidos.</li>
</ul></li>
<li><code>[5/5]</code> Añadir recursos JSON
<ul class="org-ul">
<li class="on"><code>[X]</code> Crear "tabla" de votos.</li>
<li class="on"><code>[X]</code> Crear "tabla" de comentarios.</li>
<li class="on"><code>[X]</code> Crear "tabla" de usuarios seguidos.</li>
<li class="on"><code>[X]</code> Crear "tabla" de etiquetas.</li>
<li class="on"><code>[X]</code> Crear array de palabras malsonantes.</li>
</ul></li>
<li class="on"><code>[X]</code> Añadir nueva imagen.</li>
<li class="on"><code>[X]</code> Editar una imagen.</li>
<li class="on"><code>[X]</code> Eliminar imagen.</li>
<li class="on"><code>[X]</code> Editar/Nueva imagen: Comprobar palabras prohibidas</li>
<li class="on"><code>[X]</code> Filtrar las imágenes recientes (última semana).</li>
<li class="on"><code>[X]</code> Limitar a 10 las imágenes trending.</li>
<li class="on"><code>[X]</code> Crear nuevo usuario.</li>
<li class="on"><code>[X]</code> Errores en peticiones AJAX.</li>
<li class="on"><code>[X]</code> Inicio de sesión.</li>
<li class="on"><code>[X]</code> Asignar imagen al usuario al crearla.</li>
<li><code>[4/4]</code> En función del estado de autenticación
<ul class="org-ul">
<li class="on"><code>[X]</code> Modificar la visibilidad de los botones de editar y eliminar.</li>
<li class="on"><code>[X]</code> Modificar la cabecera.</li>
<li class="on"><code>[X]</code> Modificar la visibilidad del botón de seguir.</li>
<li class="on"><code>[X]</code> Ocultar perfiles de usuario para los no autenticados.</li>
</ul></li>
<li class="on"><code>[X]</code> Límitar el número de imágenes por usuario.</li>
<li class="on"><code>[X]</code> Restablecer a 50 el límite de imágenes por usuario.</li>
<li class="on"><code>[X]</code> Seguimiento entre usuarios.</li>
<li class="off"><code>[&#xa0;]</code> Usuarios siguiendo/seguidos: Habilitar botones de seguimiento.</li>
<li class="on"><code>[X]</code> Redireccionar a los usuarios que accedan a una página no autorizada.</li>
<li><code>[2/2]</code> Comentarios:
<ul class="org-ul">
<li class="on"><code>[X]</code> Añadir comentarios.</li>
<li class="on"><code>[X]</code> RN-005.</li>
</ul></li>
<li><code>[2/2]</code> Etiquetas:
<ul class="org-ul">
<li class="on"><code>[X]</code> Crear una nueva etiqueta.</li>
<li class="on"><code>[X]</code> Asignar/Quitar una etiqueta a una imagen.</li>
</ul></li>
<li><code>[0/2]</code> Votos:
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Añadir y modificar.</li>
<li class="off"><code>[&#xa0;]</code> Calcular puntuación de las imágenes (eliminar sistema antiguo).</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Imágenes trending: solo contar los votos de la última semana.</li>
</ul>
</div>
</div>

<div id="outline-container-org1fd7062" class="outline-2">
<h2 id="org1fd7062"><span class="section-number-2">3</span> <code>[6/6]</code> Reglas de negocio</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li class="on"><code>[X]</code> Limitación en el número de fotos.</li>
<li class="on"><code>[X]</code> Uso de lenguaje adecuado.</li>
<li class="on"><code>[X]</code> Unicidad de cuentas.</li>
<li class="on"><code>[X]</code> Unicidad de etiquetas.</li>
<li class="on"><code>[X]</code> Eliminación de fotos.</li>
<li class="on"><code>[X]</code> Auto-Seguimiento.x</li>
</ol>
</div>
</div>

<div id="outline-container-orgf7365d9" class="outline-2">
<h2 id="orgf7365d9"><span class="section-number-2">4</span> <code>[15/18]</code> Requisitos funcionales</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li class="on"><code>[X]</code> Fotos recientes.</li>
<li class="on"><code>[X]</code> Registro de usuario.</li>
<li class="on"><code>[X]</code> Autenticación de usuario.</li>
<li class="on"><code>[X]</code> Añadir foto.</li>
<li class="off"><code>[&#xa0;]</code> Votar foto.</li>
<li class="on"><code>[X]</code> Modificar foto.</li>
<li class="on"><code>[X]</code> Eliminar foto.</li>
<li class="on"><code>[X]</code> Perfiles de usuarios.</li>
<li class="on"><code>[X]</code> Asociar etiqueta a foto.</li>
<li class="on"><code>[X]</code> Eliminar etiqueta de foto.</li>
<li class="on"><code>[X]</code> Crear etiqueta.</li>
<li class="on"><code>[X]</code> Buscar por etiqueta.</li>
<li class="on"><code>[X]</code> Comentar foto.</li>
<li class="on"><code>[X]</code> Seguir a otro usuario.</li>
<li class="on"><code>[X]</code> Dejar de seguir.</li>
<li class="off"><code>[&#xa0;]</code> Ver fotos de usuarios seguidos.</li>
<li class="on"><code>[X]</code> Fotos trending.</li>
<li class="off"><code>[&#xa0;]</code> Usuarios trending.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pablo Dávila Herrero</p>
<p class="date">Created: 2020-05-23 sáb 03:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
